RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32G43x_Firmware_Library/n32g43x_std_periph_driver/inc/n32g43x_rcc.h
/** @addtogroup LSE_configuration
 * @{
 */

#define RCC_LSE_DISABLE ((uint32_t)0x00000000)
#define RCC_LSE_ENABLE  ((uint32_t)0x00000001)
#define RCC_LSE_BYPASS  ((uint32_t)0x00000004)
#define IS_RCC_LSE(LSE) (((LSE) == RCC_LSE_DISABLE) || ((LSE) == RCC_LSE_ENABLE) || ((LSE) == RCC_LSE_BYPASS))
/**
 * @}
 */

/** @addtogroup RTC_clock_source
 * @{
 */

#define RCC_RTCCLK_SRC_NONE       ((uint32_t)0x00000000)
#define RCC_RTCCLK_SRC_LSE        ((uint32_t)0x00000100)
#define RCC_RTCCLK_SRC_LSI        ((uint32_t)0x00000200)
#define RCC_RTCCLK_SRC_HSE_DIV32  ((uint32_t)0x00000300)
#define IS_RCC_RTCCLK_SRC(SOURCE)                                                                                      \
    (((SOURCE) == RCC_RTCCLK_SRC_NONE) || ((SOURCE) == RCC_RTCCLK_SRC_LSE) || ((SOURCE) == RCC_RTCCLK_SRC_LSI)         \
     || ((SOURCE) == RCC_RTCCLK_SRC_HSE_DIV32))
/**
 * @}
 */

/** @addtogroup LSX_clock_source
 * @{
 */

#define RCC_LSXCLK_SRC_LSI        ((uint32_t)0x00000000)
#define RCC_LSXCLK_SRC_LSE        ((uint32_t)0x00000020)
#define IS_RCC_LSXCLK_SRC(SOURCE)                                                                                      \
    (((SOURCE) == RCC_LSXCLK_SRC_LSI) || ((SOURCE) == RCC_LSXCLK_SRC_LSE))
/**
 * @}
 */

/** @addtogroup AHB_peripheral
 * @{
 */

#define RCC_AHB_PERIPH_DMA    ((uint32_t)0x00000001)
#define RCC_AHB_PERIPH_SRAM   ((uint32_t)0x00000004)
#define RCC_AHB_PERIPH_FLITF  ((uint32_t)0x00000010)
#define RCC_AHB_PERIPH_CRC    ((uint32_t)0x00000040)
#define RCC_AHB_PERIPH_RNGC   ((uint32_t)0x00000200)
#define RCC_AHB_PERIPH_SAC    ((uint32_t)0x00000800)
#define RCC_AHB_PERIPH_ADC    ((uint32_t)0x00001000)

#define IS_RCC_AHB_PERIPH(PERIPH) ((((PERIPH)&0xFFFFE5AA) == 0x00) && ((PERIPH) != 0x00))

/**
 * @}
 */

/** @addtogroup APB2_peripheral
 * @{
 */

#define RCC_APB2_PERIPH_AFIO   ((uint32_t)0x00000001)
#define RCC_APB2_PERIPH_GPIOA  ((uint32_t)0x00000004)
#define RCC_APB2_PERIPH_GPIOB  ((uint32_t)0x00000008)
#define RCC_APB2_PERIPH_GPIOC  ((uint32_t)0x00000010)
#define RCC_APB2_PERIPH_GPIOD  ((uint32_t)0x00000020)
#define RCC_APB2_PERIPH_TIM1   ((uint32_t)0x00000800)
#define RCC_APB2_PERIPH_SPI1   ((uint32_t)0x00001000)
#define RCC_APB2_PERIPH_TIM8   ((uint32_t)0x00002000)
#define RCC_APB2_PERIPH_USART1 ((uint32_t)0x00004000)
#define RCC_APB2_PERIPH_UART4  ((uint32_t)0x00020000)
#define RCC_APB2_PERIPH_UART5  ((uint32_t)0x00040000)
#define RCC_APB2_PERIPH_SPI2   ((uint32_t)0x00080000)

#define IS_RCC_APB2_PERIPH(PERIPH) ((((PERIPH)&0xFFF187C2) == 0x00) && ((PERIPH) != 0x00))
/**
 * @}
 */

/** @addtogroup APB1_peripheral
 * @{
 */

#define RCC_APB1_PERIPH_TIM2      ((uint32_t)0x00000001)
#define RCC_APB1_PERIPH_TIM3      ((uint32_t)0x00000002)
#define RCC_APB1_PERIPH_TIM4      ((uint32_t)0x00000004)
#define RCC_APB1_PERIPH_TIM5      ((uint32_t)0x00000008)
#define RCC_APB1_PERIPH_TIM6      ((uint32_t)0x00000010)
#define RCC_APB1_PERIPH_TIM7      ((uint32_t)0x00000020)
#define RCC_APB1_PERIPH_COMP      ((uint32_t)0x00000040)
#define RCC_APB1_PERIPH_COMP_FILT ((uint32_t)0x00000080)
#define RCC_APB1_PERIPH_AFEC      ((uint32_t)0x00000100)
#define RCC_APB1_PERIPH_TIM9      ((uint32_t)0x00000200)
#define RCC_APB1_PERIPH_TSC       ((uint32_t)0x00000400)
#define RCC_APB1_PERIPH_WWDG      ((uint32_t)0x00000800)
#define RCC_APB1_PERIPH_USART2    ((uint32_t)0x00020000)
#define RCC_APB1_PERIPH_USART3    ((uint32_t)0x00040000)
#define RCC_APB1_PERIPH_I2C1      ((uint32_t)0x00200000)
#define RCC_APB1_PERIPH_I2C2      ((uint32_t)0x00400000)
#define RCC_APB1_PERIPH_USB       ((uint32_t)0x00800000)
#define RCC_APB1_PERIPH_CAN       ((uint32_t)0x02000000)
#define RCC_APB1_PERIPH_PWR       ((uint32_t)0x10000000)
#define RCC_APB1_PERIPH_DAC       ((uint32_t)0x20000000)
#define RCC_APB1_PERIPH_OPAMP     ((uint32_t)0x80000000)

#define IS_RCC_APB1_PERIPH(PERIPH) ((((PERIPH)&0x4D19F000) == 0x00) && ((PERIPH) != 0x00))

/**
 * @}
 */

/** @addtogroup RET_peripheral
 * @{
 */

#define RCC_RET_PERIPH_LPTIM  ((uint32_t)0x00000040)
#define RCC_RET_PERIPH_LPUART ((uint32_t)0x00000080)

#define IS_RCC_RET_PERIPH(PERIPH) ((((PERIPH)&0xFFFFFF3F) == 0x00) && ((PERIPH) != 0x00))

/**
 * @}
 */

/** @addtogroup LPTIM
 * @{
 */
#define RCC_LPTIMCLK_SRC_MASK  ((uint32_t)0xFFFFFFF8)

#define RCC_LPTIMCLK_SRC_APB1  ((uint32_t)0x00000000)
#define RCC_LPTIMCLK_SRC_LSI   ((uint32_t)0x00000001)
#define RCC_LPTIMCLK_SRC_HSI   ((uint32_t)0x00000002)
#define RCC_LPTIMCLK_SRC_LSE   ((uint32_t)0x00000003)
#define RCC_LPTIMCLK_SRC_COMP1 ((uint32_t)0x00000004)
#define RCC_LPTIMCLK_SRC_COMP2 ((uint32_t)0x00000005)

#define IS_RCC_LPTIM_CLK(LPTIMCLK) (((LPTIMCLK) == RCC_LPTIMCLK_SRC_APB1)   \
                                 || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_LSI)    \
                                 || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_HSI)    \
                                 || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_LSE)    \
                                 || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_COMP1)  \
                                 || ((LPTIMCLK) == RCC_LPTIMCLK_SRC_COMP2))

/**
 * @}
 */

/** @addtogroup LPUART
 * @{
 */
#define RCC_LPUARTCLK_SRC_MASK   ((uint32_t)0xFFFFFFE7)

#define RCC_LPUARTCLK_SRC_APB1   ((uint32_t)0x00000000)
#define RCC_LPUARTCLK_SRC_SYSCLK ((uint32_t)0x00000008)
#define RCC_LPUARTCLK_SRC_HSI    ((uint32_t)0x00000010)
#define RCC_LPUARTCLK_SRC_LSE    ((uint32_t)0x00000018)

#define IS_RCC_LPUART_CLK(LPUARTCLK) (((LPUARTCLK)&0xFFFFFFE7) == 0x00)

/**
 * @}
 */

/** @addtogroup SRAM_CTRLSTS
 * @{
 */

#define SRAM1_PARITYERROR_INT ((uint32_t)0x00000001)
#define SRAM2_PARITYERROR_INT ((uint32_t)0x00000008)
#define IS_RCC_SRAMERRORINT(PARITYERROR_INT) (((PARITYERROR_INT) == SRAM1_PARITYERROR_INT) \
                                           || ((PARITYERROR_INT) == SRAM2_PARITYERROR_INT))

#define SRAM1_PARITYERROR_RESET ((uint32_t)0x00000002)
#define SRAM2_PARITYERROR_RESET ((uint32_t)0x00000010)
#define IS_RCC_SRAMERRORRESET(PARITYERROR_RESET) (((PARITYERROR_RESET) == SRAM1_PARITYERROR_RESET) \
                                               || ((PARITYERROR_RESET) == SRAM2_PARITYERROR_RESET))

#define SRAM1_PARITYERROR_FLAG ((uint32_t)0x00000004)
#define SRAM2_PARITYERROR_FLAG ((uint32_t)0x00000020)
#define IS_RCC_SRAMERRORFLAG(PARITYERROR_FLAG) (((PARITYERROR_FLAG) == SRAM1_PARITYERROR_FLAG) \
                                                 || ((PARITYERROR_FLAG) == SRAM2_PARITYERROR_FLAG))

/**
 * @}
 */

#define RCC_MCO_CLK_NUM0  ((uint32_t)0x00000000)
#define RCC_MCO_CLK_NUM1  ((uint32_t)0x10000000)
#define RCC_MCO_CLK_NUM2  ((uint32_t)0x20000000)
#define RCC_MCO_CLK_NUM3  ((uint32_t)0x30000000)
#define RCC_MCO_CLK_NUM4  ((uint32_t)0x40000000)
#define RCC_MCO_CLK_NUM5  ((uint32_t)0x50000000)
#define RCC_MCO_CLK_NUM6  ((uint32_t)0x60000000)
#define RCC_MCO_CLK_NUM7  ((uint32_t)0x70000000)
#define RCC_MCO_CLK_NUM8  ((uint32_t)0x80000000)
#define RCC_MCO_CLK_NUM9  ((uint32_t)0x90000000)
#define RCC_MCO_CLK_NUM10 ((uint32_t)0xA0000000)
#define RCC_MCO_CLK_NUM11 ((uint32_t)0xB0000000)
#define RCC_MCO_CLK_NUM12 ((uint32_t)0xC0000000)
#define RCC_MCO_CLK_NUM13 ((uint32_t)0xD0000000)
#define RCC_MCO_CLK_NUM14 ((uint32_t)0xE0000000)
#define RCC_MCO_CLK_NUM15 ((uint32_t)0xF0000000)
#define IS_RCC_MCOCLKPRE(NUM)                                                                              \
       (((NUM) == RCC_MCO_CLK_NUM0)  || ((NUM) == RCC_MCO_CLK_NUM1)  || ((NUM) == RCC_MCO_CLK_NUM2)        \
     || ((NUM) == RCC_MCO_CLK_NUM3)  || ((NUM) == RCC_MCO_CLK_NUM4)  || ((NUM) == RCC_MCO_CLK_NUM5)        \
     || ((NUM) == RCC_MCO_CLK_NUM6)  || ((NUM) == RCC_MCO_CLK_NUM7)  || ((NUM) == RCC_MCO_CLK_NUM8)        \
     || ((NUM) == RCC_MCO_CLK_NUM9)  || ((NUM) == RCC_MCO_CLK_NUM10) || ((NUM) == RCC_MCO_CLK_NUM11)       \
     || ((NUM) == RCC_MCO_CLK_NUM12) || ((NUM) == RCC_MCO_CLK_NUM13) || ((NUM) == RCC_MCO_CLK_NUM14)       \
     || ((NUM) == RCC_MCO_CLK_NUM15))

/** @addtogroup Clock_source_to_output_on_MCO_pin
 * @{
 */

#define RCC_MCO_NOCLK       ((uint8_t)0x00)
#define RCC_MCO_LSI         ((uint8_t)0x01)
#define RCC_MCO_LSE         ((uint8_t)0x02)
#define RCC_MCO_MSI         ((uint8_t)0x03)
#define RCC_MCO_SYSCLK      ((uint8_t)0x04)
#define RCC_MCO_HSI         ((uint8_t)0x05)
#define RCC_MCO_HSE         ((uint8_t)0x06)
#define RCC_MCO_PLLCLK      ((uint8_t)0x07)

